{
  "publishedAt": "10th Dec 2023",
  "title": "💌 10th Dec 2023 💌",
  "content": "Dearest Palak,\n\nSo I had left some old stuff here in Silchar the last time I came here. Being absolutely jobless, I was going through them this afternoon and among many other things from my childhood, I found two slam books - the first one from 2000-2001. We were 10-11 years old then.\n\nWalking down the memory lane seemed like a good idea and so I started reading it… What amazed me was that most of our male friends hadn’t hesitated to write their favourite color as Pink - a color many of us would now say to be a ‘gay’ color or a ‘girly’ color. Our minds were still not corrupted by nonsensical beliefs of the society. I started missing this innocence in us…\n\nAs we grew up, this innocence vanished, not that all of us gave up our ignorance though… Instead, an inexplicable cynicism engulfed most of us, the extent of which varied from person to person, based on what we were made to believe, and that was one of the reasons why many of us drifted apart. Our priorities have changed.\n\nAnyway, the other thing worth mentioning is that none of our friends are now doing a job that they had wanted to do then… Their ‘ambition’s were to become computer consultants, fashion designer, sailor, actor, singer and the likes. Well, kids are like that. They watch ’Border’ and decide to join the Indian Army… Next day they watch ‘Superman’ and their ambition changes.\n\nThe second slam book was filled up during our last two years in school. Some of us had now decided to be doctors or engineers. Most of us were still clueless though… The pages were filled up with promises and ‘you are my best friend’ quotes. We were a small class and so everybody was everybody’s best friend. There wasn’t much of ‘group baazi’.\n\nTurning over, I stumbled upon your page. And I remembered how I used to stare at it, especially that one sentence under ‘Lines for you’. 'You’re a sweetheart, Ram…,' you had written. I used to stare at it for hours and day dream… I was so melodramatic. But who wasn’t?\n\nBy the way, do you remember why you had called me ‘Ram’? It’s because back then I had a stubble and our classmates used to call me ‘Ram Chhagol’. 😔\n\nYou never had any nickname in school no? Except ‘Bulty’? 😂 Then I remembered that many of your friends - not from GVHSS though, probably from DPS and Pune - used to to call you ‘Palak’ - feather. One of your initial email IDs was palak_89@yahoo.co.in. I always wondered how you got this name… But it suits you. Feather is a symbol of lightness, freedom and grace.\n\nI suddenly remembered the first verse of the song ‘Box of Memories’ by Georgia Webster:\n\nI’ve got a box of memories under my bed\nAnd when I take it out it messes with my head\nCovered in the thickest coat of dust\nYou taste it when it opens up\nSometimes when I get lonely I dive deep inside\nDig through the polaroids and letters that I hide\nFrom myself cause it’s so hard to see\nThe things that once held all of me.\n\nNah, it doesn’t mess with my head when I think about you. But to think that we are just a few kilometres away… Damn!\n\nWith love hugs and other things,\nP",
  "featuredImage": "/images/uploads/jake-weirick-bTmhh-Exx9s-unsplash.jpg"
}
